{
  "app_title": "KIRICAB Tools - Herramientas web gratuitas para optimizar tus tareas digitales diarias",
  "app_description": "KIRICAB ofrece herramientas web gratuitas para optimizar tus tareas digitales diarias, incluyendo generaci칩n segura de contrase침as, creaci칩n de emojis de Slack y comparaci칩n de texto (Diff Checker). No requiere instalaci칩n, cualquiera puede usarlas de inmediato. Apoyamos tus actividades en l칤nea para que sean m치s seguras y c칩modas. Estas herramientas funcionan solo en tu PC y no se env칤a informaci칩n al servidor, por lo que puedes usarlas con tranquilidad.",
  "header_title": "KIRICAB Tools",
  "hero_heading": "Herramientas web gratuitas para optimizar tus tareas digitales diarias",
  "hero_paragraph": "KIRICAB ofrece herramientas web gratuitas para optimizar tus tareas digitales diarias. No requiere instalaci칩n, cualquiera puede usarlas de inmediato. Apoyamos tus actividades en l칤nea para que sean m치s seguras y c칩modas. Estas herramientas funcionan solo en tu PC y no se env칤a informaci칩n al servidor, por lo que puedes usarlas con tranquilidad.",
  "button_passgen": "Ir al Generador de Contrase침as",
  "button_slackemojigen": "Ir al Generador de Emojis de Slack",
  "button_diff": "Ir a la Herramienta de Comparaci칩n de Texto Diff",
  "footer_copyright": "&copy; 2025 Kiricab. All Rights Reserved.",
  "passgen_app_title": "Generador de Contrase침as Seguras | Genera Contrase침as Fuertes al Instante",
  "passgen_app_description": "Genera 20 contrase침as fuertes y seguras a la vez, combinando may칰sculas, min칰sculas, n칰meros y s칤mbolos. Personaliza la longitud y la semilla aleatoria. Copia f치cilmente con un solo clic.",
  "passgen_header_heading": "游댏 Generador de Contrase침as Seguras",
  "passgen_header_paragraph": "Genera y Copia Contrase침as Fuertes con Un Clic",
  "passgen_settings_heading": "Opciones de Generaci칩n",
  "passgen_length_label": "Longitud de la Contrase침a:",
  "passgen_length_8": "8 Caracteres",
  "passgen_length_12": "12 Caracteres",
  "passgen_length_16": "16 Caracteres",
  "passgen_length_custom": "Personalizado (4-64)",
  "passgen_char_type_label": "Incluir Tipos de Caracteres:",
  "passgen_char_uppercase": "May칰sculas (ABC)",
  "passgen_char_lowercase": "Min칰sculas (abc)",
  "passgen_char_numbers": "N칰meros (123)",
  "passgen_char_symbols": "S칤mbolos",
  "passgen_count_label": "Cantidad a Generar:",
  "passgen_seed_label": "Semilla Aleatoria (Comparte el enlace con esto):",
  "passgen_seed_placeholder": "Introduce la semilla...",
  "passgen_generate_button": "Generar Contrase침as",
  "passgen_results_heading": "Resultados Generados (Clic para Copiar)",
  "passgen_copy_link_button": "游댕 Copiar Enlace",
  "passgen_seo_heading": "쯇or qu칠 necesitas contrase침as fuertes?",
  "passgen_seo_paragraph1": "En la sociedad digital actual, la informaci칩n personal y los datos corporativos est치n constantemente expuestos a la amenaza de ciberataques. Las contrase침as simples y f치ciles de adivinar (por ejemplo, 'password123' o fechas de nacimiento) pueden ser descifradas en segundos mediante ataques de fuerza bruta.",
  "passgen_seo_paragraph2": "Las contrase침as largas que combinan aleatoriamente may칰sculas, min칰sculas, n칰meros y s칤mbolos, como las generadas por esta herramienta, son extremadamente dif칤ciles de descifrar y son el primer paso m치s f치cil y efectivo para proteger tus cuentas del acceso no autorizado.",
  "passgen_seed_disabled_tooltip": "Introduce una semilla aleatoria para habilitar",
  "passgen_copy_link_tooltip": "Copiar enlace con la configuraci칩n aplicada",
  "passgen_alert_select_symbol": "Por favor, selecciona al menos un s칤mbolo para usar.",
  "passgen_alert_select_charset": "Por favor, selecciona al menos un tipo de car치cter.",
  "passgen_alert_length_mismatch": "La longitud de la contrase침a debe ser mayor o igual al n칰mero de tipos de caracteres seleccionados ({count}).",
  "passgen_copy_complete": "춰Copiado!",
  "passgen_copy_link_error": "Error al copiar el enlace",
  "passgen_copied_tooltip": "춰Copiado!",
  "passgen_copy_error": "Error al copiar al portapapeles: "
}
